CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/MajorTomToGroundControl/CFD/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    atmosphere
    {
        type            MarshakRadiationFixedTemperature;
        Trad            uniform 500;
        emissivityMode  lookup;
        emissivity      uniform 1;
        value           uniform 0;
    }

}

// ************************************************************************* //
