CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/MajorTomToGroundControl/CFD/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;
radiationModel  P1CFDEM; 

// Number of flow iterations per radiation iteration
solverFreq 1;

absorptionEmissionModel binaryAbsorptionEmission;

binaryAbsorptionEmissionCoeffs
{
    model1
    {
        absorptionEmissionModel constantAbsorptionEmission;
        constantAbsorptionEmissionCoeffs
        {
            absorptivity    absorptivity    [0 -1 0 0 0 0 0] 0.0;
            emissivity      emissivity      [0 -1 0 0 0 0 0] 0.;
            E               E   [1 -1 -3 0 0 0 0] 0;
        }
    }
    model2
    {
        absorptionEmissionModel absorptionEmissionCFDEM;
        absorptionEmissionCFDEMCoeffs
        {
            AbsorptionCoeffFieldName "ap";
            EmissionFieldName "Ep";
            useParticleAbsorptionCoefficient true;
            useParticleEmission true;
        }
    }
}

scatterModel   constantScatterCFDEM;
constantScatterCFDEMCoeffs
{
    sigma   1.23e-5;
    C       0.;
    ScatteringCoeffFieldName "sigmap";
    useParticleScatteringCoefficient true;
}

sootModel       none;

// ************************************************************************* //
