CFDEMcoupling-MATHEGRAM/tutorials/cfdemSolverBuoyantPimple/MajorTomToGroundControl/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.;

vertices
(
    ( -5 -5 -5 )
    (  5 -5 -5 )
    (  5  5 -5 )
    ( -5  5 -5 )
    ( -5 -5  5 )
    (  5 -5  5 )
    (  5  5  5 )
    ( -5  5  5 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (3 3 3) simpleGrading (1 1 1)
);

edges
(
);

boundary         
(
    atmosphere
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 4 7 3)
            (2 6 5 1)
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
